In [10]:
import pandas as pd

**Q1) Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.**

In [11]:
data = [4,8,15,16,23,42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [12]:
type(series)

pandas.core.series.Series

**Q2) Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.**

In [13]:
import random as r
test_elements = [r.randint(1,100) for i in range(10)]
series = pd.Series(test_elements)
series

0    81
1    83
2    75
3     5
4    84
5    27
6    36
7    38
8    90
9    49
dtype: int64

In [14]:
type(series)

pandas.core.series.Series

**Q3) Create a Pandas DataFrame that contains the following data:**

---
|Name  |Age|Gender|
|---   |---|---   |
|Alice |25 |Female|
|Bob   |30 |Male  |
|Claire|27 |Female|

In [15]:
data = [
    ['Alice', 25, 'Female'],
    ['Bob', 30, 'Male'],
    ['Claire', 27, 'Female']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'Gender'])
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Q4) What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.**

Dataframe is a 2D structure similar to excel sheet or SQL table where the data is organized in terms of 
rows and columns.

However, series is a 1D structure similar to list.

Ideally in versions before 1.5.0, series used to be value-mutable but size-immutable which means you cannot add/remove elements in series, while dataframe is both size-mutable and value-mutable

However, in pandas 1.5.0, series is also size and value mutable.

In [16]:
data = [
    ['Alice', 25, 'Female'],
    ['Bob', 30, 'Male'],
    ['Claire', 27, 'Female']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'Gender'], index=['ml','dl','ai'])
print(df)

      Name  Age  Gender
ml   Alice   25  Female
dl     Bob   30    Male
ai  Claire   27  Female

In [17]:
series = pd.Series([1,2,3])
print(series)

0    1
1    2
2    3
dtype: int64

In [18]:
series[3] = 'pwskills'
print(pd.__version__)
print(series)

1.5.0
0           1
1           2
2           3
3    pwskills
dtype: object

**Q5) What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?**

In [19]:
data = [
    ['Alice', 25, 'Female'],
    ['Bob', 30, 'Male'],
    ['Claire', 27, 'Female']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'Gender'])

In [20]:
# creating new column in dataframe
df['age'] = 25
df

     Name  Age  Gender  age
0   Alice   25  Female   25
1     Bob   30    Male   25
2  Claire   27  Female   25

In [21]:
# .apply() on series
df['binary_gender'] = df['Gender'].apply(lambda x: 1 if x=='Male' else 0)

In [22]:
df

     Name  Age  Gender  age  binary_gender
0   Alice   25  Female   25              0
1     Bob   30    Male   25              1
2  Claire   27  Female   25              0

In [24]:
# dropping column
df = df.drop('age', axis=1)

In [25]:
df

     Name  Age  Gender  binary_gender
0   Alice   25  Female              0
1     Bob   30    Male              1
2  Claire   27  Female              0

In [26]:
# dropping row
df = df.drop(2, axis=0)
df

    Name  Age  Gender  binary_gender
0  Alice   25  Female              0
1    Bob   30    Male              1

In [31]:
# slicing data with selected columns
df.loc[1:, ['Name', 'binary_gender']]

  Name  binary_gender
1  Bob              1

In [36]:
# updating value
df.loc[1, 'Name'] = 'dev'

In [37]:
df

    Name  Age  Gender  binary_gender
0  Alice   25  Female              0
1    dev   30    Male              1

**Q6) Which of the following is mutable in nature Series, DataFrame, Panel?**

Both series and dataframes are size and value mutable in version 1.5.0.
In older versions of pandas, series was size-immutable which means no element could be added/removed.

Panel on the other hand is mutable which was being used in older versions and is now deprecated and no longer 
being used, instead we use MultiIndex

**Q7. Create a DataFrame using multiple Series. Explain with an example.**

In [51]:
names = pd.Series(['Alice', 'Bob', 'John'])
ages = pd.Series([23, 25, 27])
gender = pd.Series(['Female', 'Male', 'Male'])

df = pd.DataFrame({"names": names, "ages": ages, "gender": gender})

In [52]:
df

   names  ages  gender
0  Alice    23  Female
1    Bob    25    Male
2   John    27    Male